In [1]:
# Data exploration
# row CRUD operations

In [2]:
import pandas as pd

In [3]:
data = {"Apples" : [102,500,250,75], "Grapes" : [50,150,90,45]}
df = pd.DataFrame(data)

In [4]:
df

   Apples  Grapes
0     102      50
1     500     150
2     250      90
3      75      45

In [5]:
print(df['Grapes'])
df[['Grapes']]    #gives datafrome

0     50
1    150
2     90
3     45
Name: Grapes, dtype: int64

   Grapes
0      50
1     150
2      90
3      45

In [6]:
df['Bananas'] = df['Grapes'] + 50
df

   Apples  Grapes  Bananas
0     102      50      100
1     500     150      200
2     250      90      140
3      75      45       95

In [7]:
df.drop(['Bananas'], axis = 1)

# If inplace is not given, the output is printed (Dataframe)
# But, if inplace is given True then the output is not displayed

   Apples  Grapes
0     102      50
1     500     150
2     250      90
3      75      45

In [8]:
df

   Apples  Grapes  Bananas
0     102      50      100
1     500     150      200
2     250      90      140
3      75      45       95

In [9]:
df['Pear'] = df['Bananas'] + 100
df['Mangoes'] = df['Pear'] + 500
df['Jackfruit'] = df['Grapes'] + 150
df['Strawberry'] = df['Jackfruit'] + 200
df['Oranges'] = df['Strawberry'] + 70

In [10]:
df

   Apples  Grapes  Bananas  Pear  Mangoes  Jackfruit  Strawberry  Oranges
0     102      50      100   200      700        200         400      470
1     500     150      200   300      800        300         500      570
2     250      90      140   240      740        240         440      510
3      75      45       95   195      695        195         395      465

In [11]:
# ROW SELECTION
# loc & iloc

In [12]:
# loc => index name
print(df.loc[3])
df.loc[[3]]

Apples         75
Grapes         45
Bananas        95
Pear          195
Mangoes       695
Jackfruit     195
Strawberry    395
Oranges       465
Name: 3, dtype: int64

   Apples  Grapes  Bananas  Pear  Mangoes  Jackfruit  Strawberry  Oranges
3      75      45       95   195      695        195         395      465

In [13]:
# iloc => index
print(df.iloc[3])
df.iloc[[3]]

Apples         75
Grapes         45
Bananas        95
Pear          195
Mangoes       695
Jackfruit     195
Strawberry    395
Oranges       465
Name: 3, dtype: int64

   Apples  Grapes  Bananas  Pear  Mangoes  Jackfruit  Strawberry  Oranges
3      75      45       95   195      695        195         395      465

In [14]:
data = {"Apples" : [102,500,250,75], "Grapes" : [50,150,90,45]}
df = pd.DataFrame(data, index = ['A', 'B', 'C', 'D'])
df

   Apples  Grapes
A     102      50
B     500     150
C     250      90
D      75      45

In [15]:
df['Bananas'] = df['Grapes'] + 50
df['Pear'] = df['Bananas'] + 100
df['Mangoes'] = df['Pear'] + 500
df['Jackfruit'] = df['Grapes'] + 150
df['Strawberry'] = df['Jackfruit'] + 200
df['Oranges'] = df['Strawberry'] + 70
df

   Apples  Grapes  Bananas  Pear  Mangoes  Jackfruit  Strawberry  Oranges
A     102      50      100   200      700        200         400      470
B     500     150      200   300      800        300         500      570
C     250      90      140   240      740        240         440      510
D      75      45       95   195      695        195         395      465

In [16]:
df.loc[['C']]

   Apples  Grapes  Bananas  Pear  Mangoes  Jackfruit  Strawberry  Oranges
C     250      90      140   240      740        240         440      510

In [17]:
df.iloc[[-1]]

   Apples  Grapes  Bananas  Pear  Mangoes  Jackfruit  Strawberry  Oranges
D      75      45       95   195      695        195         395      465

In [18]:
df.iloc[2:3]
# In iloc, the rhs is exclusive

   Apples  Grapes  Bananas  Pear  Mangoes  Jackfruit  Strawberry  Oranges
C     250      90      140   240      740        240         440      510

In [19]:
df.loc['A' : 'D']
# In loc, the rhs is inclusive

# In string format includes the rhs
# But in index format excludes the rhs

   Apples  Grapes  Bananas  Pear  Mangoes  Jackfruit  Strawberry  Oranges
A     102      50      100   200      700        200         400      470
B     500     150      200   300      800        300         500      570
C     250      90      140   240      740        240         440      510
D      75      45       95   195      695        195         395      465

In [20]:
# Row addition
student_marks = {'Name' : ['Rahul','Rohit','Venkat','Sahil','Ankita'],
                'OS' : [25, 75.5, 96, 0, 100],
                'DBMS' : [20, 80, 60, 50, 99]}

df1 = pd.DataFrame(student_marks)

In [21]:
df1

     Name     OS  DBMS
0   Rahul   25.0    20
1   Rohit   75.5    80
2  Venkat   96.0    60
3   Sahil    0.0    50
4  Ankita  100.0    99

In [22]:
data2 = {'Name' : 'Robby', 'OS' : 60.5, 'DBMS' : 55.5}

In [23]:
# Method 1 to add a new row to df

# df1 = df1.append(data2, ignore_index = True)
# Append attribute is not available in python latest versions

In [24]:
# Method 2 to add a new row to df using concat()
df2 = pd.DataFrame(data2, index = [0])
df2

    Name    OS  DBMS
0  Robby  60.5  55.5

In [25]:
data = pd.concat([df2, df1], ignore_index = True)
data

     Name     OS  DBMS
0   Robby   60.5  55.5
1   Rahul   25.0  20.0
2   Rohit   75.5  80.0
3  Venkat   96.0  60.0
4   Sahil    0.0  50.0
5  Ankita  100.0  99.0

In [26]:
data3 = {'Name' : 'Venom', 'OS' : 80.5, 'DBMS' : 75}
df3 = pd.DataFrame(data3, index = [0])
pd.concat([df3, df1], ignore_index = True)
# Concat is temporary
# To make it permanent, you have ot assign it into a variable

     Name     OS  DBMS
0   Venom   80.5    75
1   Rahul   25.0    20
2   Rohit   75.5    80
3  Venkat   96.0    60
4   Sahil    0.0    50
5  Ankita  100.0    99

In [27]:
df1 = pd.concat([df1, df3], ignore_index = True)
df1

     Name     OS  DBMS
0   Rahul   25.0    20
1   Rohit   75.5    80
2  Venkat   96.0    60
3   Sahil    0.0    50
4  Ankita  100.0    99
5   Venom   80.5    75

In [28]:
df1 = pd.concat([df1, df3], ignore_index = True)
df1
# If ignore_index is not given, then it creates redundancy by giving same indeces to multiple rows

     Name     OS  DBMS
0   Rahul   25.0    20
1   Rohit   75.5    80
2  Venkat   96.0    60
3   Sahil    0.0    50
4  Ankita  100.0    99
5   Venom   80.5    75
6   Venom   80.5    75

In [29]:
df1.iloc[[0]]

    Name    OS  DBMS
0  Rahul  25.0    20

In [30]:
# Updation
df1.loc[7] = ['Steve', 67, 23]
df1

     Name     OS  DBMS
0   Rahul   25.0    20
1   Rohit   75.5    80
2  Venkat   96.0    60
3   Sahil    0.0    50
4  Ankita  100.0    99
5   Venom   80.5    75
6   Venom   80.5    75
7   Steve   67.0    23

In [31]:
# If there are multiple rows with same indices, then
# using loc for updation updates the values of all the occurrences. Whereas,
# usign iloc, it updates the first occurrence only

In [32]:
# df1.iloc[5] = ['Kiran', 60, 78, 56]
# Gives error

# df1.iloc[5] = ['Kiran', 60]
# It gives an error too. But when we updated the columns in similar way
# with less arguments than required, It automatically took the other values
# as NaN. But it is not the same for rows

In [33]:
# Deletion
# Column : del, pop, drop

In [34]:
# del df1.loc[5]
# pop gives an error too
df1.loc[5]

Name    Venom
OS       80.5
DBMS       75
Name: 5, dtype: object

In [35]:
df1.drop(5)
df1
# Drop works for row also

     Name     OS  DBMS
0   Rahul   25.0    20
1   Rohit   75.5    80
2  Venkat   96.0    60
3   Sahil    0.0    50
4  Ankita  100.0    99
5   Venom   80.5    75
6   Venom   80.5    75
7   Steve   67.0    23

In [36]:
df1.drop(5, inplace = True)

In [37]:
# If there are multiple rows with same index value, then all the occurrences will be deleted using drop

In [38]:
# Data Exploration
# Data Cleaning
# Data Manipulation
# Data Analysis

In [39]:
df1

     Name     OS  DBMS
0   Rahul   25.0    20
1   Rohit   75.5    80
2  Venkat   96.0    60
3   Sahil    0.0    50
4  Ankita  100.0    99
6   Venom   80.5    75
7   Steve   67.0    23

In [40]:
# head(n) : gives upto n rows by default it is 5
# print(df1.head())
df1.head()

     Name     OS  DBMS
0   Rahul   25.0    20
1   Rohit   75.5    80
2  Venkat   96.0    60
3   Sahil    0.0    50
4  Ankita  100.0    99

In [41]:
df1.head(7)

     Name     OS  DBMS
0   Rahul   25.0    20
1   Rohit   75.5    80
2  Venkat   96.0    60
3   Sahil    0.0    50
4  Ankita  100.0    99
6   Venom   80.5    75
7   Steve   67.0    23

In [42]:
# tail() : returns last n rows (by default 5 rows)
df1.tail()

     Name     OS  DBMS
2  Venkat   96.0    60
3   Sahil    0.0    50
4  Ankita  100.0    99
6   Venom   80.5    75
7   Steve   67.0    23

In [43]:
df1.tail(3)

     Name     OS  DBMS
4  Ankita  100.0    99
6   Venom   80.5    75
7   Steve   67.0    23

In [44]:
# dtypes : checks the datatypes
df1.dtypes

Name     object
OS      float64
DBMS      int64
dtype: object

In [45]:
# empty : checks whether df is empty or not (boolean answer)
df1.empty

False

In [46]:
# ndim
df1.ndim

2

In [47]:
# shape
df1.shape

(7, 3)

In [48]:
# size
df1.size

21

In [49]:
# values
df1.values

array([['Rahul', 25.0, 20],
       ['Rohit', 75.5, 80],
       ['Venkat', 96.0, 60],
       ['Sahil', 0.0, 50],
       ['Ankita', 100.0, 99],
       ['Venom', 80.5, 75],
       ['Steve', 67.0, 23]], dtype=object)

In [50]:
# keys
df1.keys

<bound method NDFrame.keys of      Name     OS  DBMS
0   Rahul   25.0    20
1   Rohit   75.5    80
2  Venkat   96.0    60
3   Sahil    0.0    50
4  Ankita  100.0    99
6   Venom   80.5    75
7   Steve   67.0    23>

In [51]:
# describe : statistical info
df1.describe()

               OS       DBMS
count    7.000000   7.000000
mean    63.428571  58.142857
std     37.301060  29.413311
min      0.000000  20.000000
25%     46.000000  36.500000
50%     75.500000  60.000000
75%     88.250000  77.500000
max    100.000000  99.000000

In [52]:
# .T  : rows become columns and vice versa
# It is temporary change
df1.T

          0      1       2      3       4      6      7
Name  Rahul  Rohit  Venkat  Sahil  Ankita  Venom  Steve
OS     25.0   75.5    96.0    0.0   100.0   80.5   67.0
DBMS     20     80      60     50      99     75     23

In [53]:
df1

     Name     OS  DBMS
0   Rahul   25.0    20
1   Rohit   75.5    80
2  Venkat   96.0    60
3   Sahil    0.0    50
4  Ankita  100.0    99
6   Venom   80.5    75
7   Steve   67.0    23

In [54]:
a = df1.T
a

          0      1       2      3       4      6      7
Name  Rahul  Rohit  Venkat  Sahil  Ankita  Venom  Steve
OS     25.0   75.5    96.0    0.0   100.0   80.5   67.0
DBMS     20     80      60     50      99     75     23

In [55]:
a.loc['Name']

0     Rahul
1     Rohit
2    Venkat
3     Sahil
4    Ankita
6     Venom
7     Steve
Name: Name, dtype: object

In [56]:
a.iloc[1]

0     25.0
1     75.5
2     96.0
3      0.0
4    100.0
6     80.5
7     67.0
Name: OS, dtype: object

In [57]:
# sum : can take parameters (the parameter is axis)
# 0 : col
# 1 : row
df1.sum()

Name    RahulRohitVenkatSahilAnkitaVenomSteve
OS                                      444.0
DBMS                                      407
dtype: object

In [58]:
df1['OS'].sum()

444.0

In [59]:
# df1.sum(1)
# Sum cannot be done as they are of different datatypes

In [60]:
# mean() : axis as parameter => default 0
df1['OS'].mean()

63.42857142857143

In [61]:
# median
df1['DBMS'].median()

60.0

In [62]:
# mode
df1['DBMS'].mode()

0    20
1    23
2    50
3    60
4    75
5    80
6    99
Name: DBMS, dtype: int64

In [63]:
# std : standard deviation
df1['OS'].std()

37.30105960450785

In [64]:
# min() and max()
df1['OS'].min()
df1['OS'].max()

100.0